app/views/users/show.html.erb

SELECT "games".* FROM "games" WHERE "games"."user_id" = $1  [["user_id", 4]]
SELECT 1 AS one FROM "games" WHERE "games"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  <h2><%= @user.first_name %>'s games</h2>
  <% unless @user.games.empty? %>

SELECT "games".* FROM "games" WHERE "games"."user_id" = $1  [["user_id", 4]]
---
      </thead>
      <% @user.games.each do |game| %>

SELECT COUNT(*) FROM "reservations" WHERE "reservations"."game_id" = $1  [["game_id", 2]]
---
        <th> <%= game.price %>€</th>
        <th> <%= game.reservations.count %></th>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 4]]
SELECT 1 AS one FROM "reviews" WHERE "reviews"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---

  <% unless @user.reviews.empty? %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 4]]
---
      </thead>
      <% @user.reviews.each do |review| %>