app/views/pages/_info_window.html.erb

<p><%= user.location %></p>
<% user.games.each do |game| %>
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = $1  [["user_id", 1]]