app/views/games/show.html.erb

        <ul>
          <% @game.reservations.each do |reservation| %>
            <% unless reservation.reviews.empty? %>
              <% reservation.reviews.each do |review| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."game_id" = $1  [["game_id", 34]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."reservation_id" = $1  [["reservation_id", 5]]
SELECT 1 AS one FROM "reviews" WHERE "reviews"."reservation_id" = $1 LIMIT $2  [["reservation_id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."reservation_id" = $1  [["reservation_id", 1]]

                <div class="review-content">
                  <p><%= review.user.first_name %> <%= "*" * review.rating %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      <% if current_user != @game.user %>
        <p> proposé par  <%= link_to @game.user.first_name  , user_path(@game.user) %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]