app/views/reservations/edit.html.erb

SELECT "games".* FROM "games"
---
  <%= f.input :start_date, label: "Change your date", as: :string, required: false, input_html: {class: "datepicker"} %>
  <%= f.input :game, collection: Game.all %>