app/views/reservations/index.html.erb

      <div class="card-reservation">
        <% if reservation.game.photos.size == 0 %>
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]

    <% @user.games.each do |game| %>
      <% game.reservations.each do |reservation| %>
---
SELECT "reservations".* FROM "reservations" WHERE (user_id = 1) ORDER BY "reservations"."created_at" DESC