app/views/reservations/new.html.erb

SELECT "games".* FROM "games"
---
     <%= f.input :start_date, placeholder: "Choose your date", label: "When would you like to rent ?", as: :string, required: false, input_html: {class: "datepicker"} %>
     <%= f.input :game, collection: Game.all %>