app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT "games".* FROM "games" ORDER BY "games"."created_at" DESC

  def create
    @game = Game.new(game_params)
    @game.user = current_user
    if @game.save!
---
INSERT INTO "games" ("name", "description", "user_id", "category", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "uno"], ["description", "fun"], ["user_id", 1], ["category", "Card"], ["price", 10], ["created_at", "2021-02-16 14:54:02.188628"], ["updated_at", "2021-02-16 14:54:02.188628"]]

  def update
    @game = Game.find(params[:id])
    if @game.update(game_params)
---
UPDATE "games" SET "updated_at" = $1 WHERE "games"."id" = $2  [["updated_at", "2021-02-18 13:50:29.739506"], ["id", 35]]