app/controllers/games_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @user = User.all.where("id = ?", Game.find(params[:id]).user_id)