app/controllers/pages_controller.rb

  def home
    @users = User.all
    # the `geocoded` scope filters only flats with coordinates (latitude & longitude)
    @markers = @users.geocoded.map do |user|
---
SELECT "users".* FROM "users" WHERE (users.latitude IS NOT NULL AND users.longitude IS NOT NULL)