app/controllers/reservations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE (user_id = 1) ORDER BY "reservations"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @reservations = @user.reservations.all

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "reservations" ("start_date", "end_date", "user_id", "game_id", "total", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @game = Game.find(params[:reservation][:game])
    @reservation = Reservation.new(reservation_params)
    nights = (@reservation.end_date - @reservation.start_date).to_i
    @reservation.game = @game
    @reservation.user = current_user
    @reservation.total = [@game.price, @game.price * nights].max
    if @reservation.save!

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def edit
    @reservation = Reservation.find(params[:id])

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def update
    @reservation = Reservation.find(params[:id])
    @game = Game.find(params[:reservation][:game])